; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob5) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear crate9)
	(at pallet3 distributor0)
	(clear crate13)
	(at pallet4 distributor1)
	(clear crate6)
	(at pallet5 distributor2)
	(clear crate10)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 depot1)
	(on crate3 pallet1)
	(at crate4 depot2)
	(on crate4 crate1)
	(at crate5 depot2)
	(on crate5 crate4)
	(at crate6 distributor1)
	(on crate6 pallet4)
	(at crate7 depot2)
	(on crate7 crate5)
	(at crate8 depot0)
	(on crate8 pallet0)
	(at crate9 depot2)
	(on crate9 crate7)
	(at crate10 distributor2)
	(on crate10 crate2)
	(at crate11 depot0)
	(on crate11 crate8)
	(at crate12 depot0)
	(on crate12 crate11)
	(at crate13 distributor0)
	(on crate13 crate0)
)

(:goal (and
		(on crate0 crate9)
		(on crate1 crate5)
		(on crate2 crate0)
		(on crate3 pallet0)
		(on crate4 crate12)
		(on crate5 pallet3)
		(on crate6 crate3)
		(on crate7 pallet2)
		(on crate8 pallet4)
		(on crate9 pallet5)
		(on crate11 crate4)
		(on crate12 crate6)
	)
))

; plan
1. (lift hoist3 crate13 crate0 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist3) (on crate13 crate0)
   added: (lifting hoist3 crate13) (clear crate0)
   goals met: 0 of 12
2. (lift hoist6 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist6) (on crate0 pallet3)
   added: (lifting hoist6 crate0) (clear pallet3)
   goals met: 0 of 12
3. (load hoist6 crate0 truck0 distributor0)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck0) (available hoist6)
   goals met: 0 of 12
4. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 12
5. (lift hoist4 crate6 pallet4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 pallet4)
   added: (lifting hoist4 crate6) (clear pallet4)
   goals met: 0 of 12
6. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 0 of 12
7. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 0 of 12
8. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 0 of 12
9. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 0 of 12
10. (drop hoist1 crate6 crate3 depot1)
   deleted: (lifting hoist1 crate6) (clear crate3)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 crate3)
   goals met: 1 of 12
11. (lift hoist0 crate12 crate11 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate11)
   added: (lifting hoist0 crate12) (clear crate11)
   goals met: 1 of 12
12. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 1 of 12
13. (load hoist0 crate12 truck0 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck0) (available hoist0)
   goals met: 1 of 12
14. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 12
15. (lift hoist0 crate11 crate8 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate8)
   added: (lifting hoist0 crate11) (clear crate8)
   goals met: 1 of 12
16. (lift hoist5 crate10 crate2 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist5) (on crate10 crate2)
   added: (lifting hoist5 crate10) (clear crate2)
   goals met: 1 of 12
17. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 1 of 12
18. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   goals met: 1 of 12
19. (drop hoist5 crate10 crate2 distributor2)
   deleted: (lifting hoist5 crate10) (clear crate2)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 crate2)
   goals met: 1 of 12
20. (lift hoist0 crate8 pallet0 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet0)
   added: (lifting hoist0 crate8) (clear pallet0)
   goals met: 1 of 12
21. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   goals met: 1 of 12
22. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 1 of 12
23. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 1 of 12
24. (unload hoist4 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 1 of 12
25. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 1 of 12
26. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 2 of 12
27. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 2 of 12
28. (unload hoist1 crate12 truck0 depot1)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 2 of 12
29. (drop hoist1 crate12 crate6 depot1)
   deleted: (lifting hoist1 crate12) (clear crate6)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate6)
   goals met: 3 of 12
30. (lift hoist2 crate9 crate7 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 crate7)
   added: (lifting hoist2 crate9) (clear crate7)
   goals met: 3 of 12
31. (load hoist2 crate9 truck1 depot2)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   goals met: 3 of 12
32. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 3 of 12
33. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 3 of 12
34. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 3 of 12
35. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 3 of 12
36. (lift hoist5 crate10 crate2 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist5) (on crate10 crate2)
   added: (lifting hoist5 crate10) (clear crate2)
   goals met: 3 of 12
37. (load hoist5 crate10 truck0 distributor2)
   deleted: (lifting hoist5 crate10)
   added: (in crate10 truck0) (available hoist5)
   goals met: 3 of 12
38. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 3 of 12
39. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 3 of 12
40. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 3 of 12
41. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 3 of 12
42. (unload hoist5 crate9 truck1 distributor2)
   deleted: (in crate9 truck1) (available hoist5)
   added: (lifting hoist5 crate9)
   goals met: 3 of 12
43. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 3 of 12
44. (drop hoist5 crate9 pallet5 distributor2)
   deleted: (lifting hoist5 crate9) (clear pallet5)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 pallet5)
   goals met: 4 of 12
45. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 4 of 12
46. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 4 of 12
47. (drop hoist5 crate0 crate9 distributor2)
   deleted: (lifting hoist5 crate0) (clear crate9)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 crate9)
   goals met: 5 of 12
48. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 5 of 12
49. (drop hoist5 crate2 crate0 distributor2)
   deleted: (lifting hoist5 crate2) (clear crate0)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 crate0)
   goals met: 6 of 12
50. (lift hoist2 crate7 crate5 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate5)
   added: (lifting hoist2 crate7) (clear crate5)
   goals met: 6 of 12
51. (load hoist2 crate7 truck1 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   goals met: 6 of 12
52. (lift hoist2 crate5 crate4 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 crate4)
   added: (lifting hoist2 crate5) (clear crate4)
   goals met: 6 of 12
53. (load hoist2 crate5 truck1 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 6 of 12
54. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 6 of 12
55. (unload hoist6 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 6 of 12
56. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 6 of 12
57. (drop hoist6 crate5 pallet3 distributor0)
   deleted: (lifting hoist6 crate5) (clear pallet3)
   added: (available hoist6) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 7 of 12
58. (lift hoist2 crate4 crate1 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate1)
   added: (lifting hoist2 crate4) (clear crate1)
   goals met: 7 of 12
59. (load hoist2 crate4 truck1 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   goals met: 7 of 12
60. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 7 of 12
61. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 7 of 12
62. (unload hoist1 crate4 truck1 depot1)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 7 of 12
63. (drop hoist1 crate4 crate12 depot1)
   deleted: (lifting hoist1 crate4) (clear crate12)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate12)
   goals met: 8 of 12
64. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 8 of 12
65. (load hoist2 crate1 truck1 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 8 of 12
66. (unload hoist2 crate7 truck1 depot2)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   goals met: 8 of 12
67. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 8 of 12
68. (lift hoist1 crate4 crate12 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate12)
   added: (lifting hoist1 crate4) (clear crate12)
   goals met: 7 of 12
69. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 7 of 12
70. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 7 of 12
71. (unload hoist6 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist6)
   added: (lifting hoist6 crate1)
   goals met: 7 of 12
72. (drop hoist6 crate1 crate5 distributor0)
   deleted: (lifting hoist6 crate1) (clear crate5)
   added: (available hoist6) (at crate1 distributor0) (clear crate1) (on crate1 crate5)
   goals met: 8 of 12
73. (unload hoist6 crate11 truck1 distributor0)
   deleted: (in crate11 truck1) (available hoist6)
   added: (lifting hoist6 crate11)
   goals met: 8 of 12
74. (load hoist3 crate13 truck1 distributor0)
   deleted: (lifting hoist3 crate13)
   added: (in crate13 truck1) (available hoist3)
   goals met: 8 of 12
75. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 8 of 12
76. (unload hoist1 crate4 truck1 depot1)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 8 of 12
77. (drop hoist1 crate4 crate12 depot1)
   deleted: (lifting hoist1 crate4) (clear crate12)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate12)
   goals met: 9 of 12
78. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 9 of 12
79. (lift hoist1 crate4 crate12 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate12)
   added: (lifting hoist1 crate4) (clear crate12)
   goals met: 8 of 12
80. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 8 of 12
81. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 8 of 12
82. (unload hoist3 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 8 of 12
83. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 8 of 12
84. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 8 of 12
85. (drop hoist2 crate7 pallet2 depot2)
   deleted: (lifting hoist2 crate7) (clear pallet2)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 pallet2)
   goals met: 9 of 12
86. (lift hoist1 crate12 crate6 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate6)
   added: (lifting hoist1 crate12) (clear crate6)
   goals met: 8 of 12
87. (load hoist1 crate12 truck0 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   goals met: 8 of 12
88. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 12
89. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 8 of 12
90. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 8 of 12
91. (load hoist6 crate11 truck1 distributor0)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck1) (available hoist6)
   goals met: 8 of 12
92. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 12
93. (unload hoist6 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist6)
   added: (lifting hoist6 crate12)
   goals met: 8 of 12
94. (load hoist6 crate12 truck1 distributor0)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck1) (available hoist6)
   goals met: 8 of 12
95. (unload hoist6 crate11 truck1 distributor0)
   deleted: (in crate11 truck1) (available hoist6)
   added: (lifting hoist6 crate11)
   goals met: 8 of 12
96. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 8 of 12
97. (drop hoist3 crate4 crate1 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate1)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate1)
   goals met: 8 of 12
98. (unload hoist1 crate12 truck1 depot1)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 8 of 12
99. (drop hoist1 crate12 crate6 depot1)
   deleted: (lifting hoist1 crate12) (clear crate6)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate6)
   goals met: 9 of 12
100. (lift hoist3 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate1)
   added: (lifting hoist3 crate4) (clear crate1)
   goals met: 9 of 12
101. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 9 of 12
102. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 9 of 12
103. (lift hoist1 crate12 crate6 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate6)
   added: (lifting hoist1 crate12) (clear crate6)
   goals met: 8 of 12
104. (load hoist1 crate12 truck0 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   goals met: 8 of 12
105. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 12
106. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 8 of 12
107. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 8 of 12
108. (drop hoist6 crate11 crate1 distributor0)
   deleted: (lifting hoist6 crate11) (clear crate1)
   added: (available hoist6) (at crate11 distributor0) (clear crate11) (on crate11 crate1)
   goals met: 8 of 12
109. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 12
110. (unload hoist6 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist6)
   added: (lifting hoist6 crate12)
   goals met: 8 of 12
111. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 8 of 12
112. (load hoist6 crate12 truck0 distributor0)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck0) (available hoist6)
   goals met: 8 of 12
113. (unload hoist6 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 8 of 12
114. (lift hoist3 crate11 crate1 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist3) (on crate11 crate1)
   added: (lifting hoist3 crate11) (clear crate1)
   goals met: 8 of 12
115. (load hoist3 crate11 truck0 distributor0)
   deleted: (lifting hoist3 crate11)
   added: (in crate11 truck0) (available hoist3)
   goals met: 8 of 12
116. (unload hoist3 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist3)
   added: (lifting hoist3 crate12)
   goals met: 8 of 12
117. (drop hoist3 crate12 crate1 distributor0)
   deleted: (lifting hoist3 crate12) (clear crate1)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 crate1)
   goals met: 8 of 12
118. (drop hoist6 crate4 crate12 distributor0)
   deleted: (lifting hoist6 crate4) (clear crate12)
   added: (available hoist6) (at crate4 distributor0) (clear crate4) (on crate4 crate12)
   goals met: 9 of 12
119. (unload hoist6 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist6)
   added: (lifting hoist6 crate11)
   goals met: 9 of 12
120. (lift hoist1 crate6 crate3 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   goals met: 8 of 12
121. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 8 of 12
122. (lift hoist1 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 8 of 12
123. (load hoist1 crate3 truck1 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 8 of 12
124. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 8 of 12
125. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 8 of 12
126. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 9 of 12
127. (lift hoist3 crate4 crate12 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate12)
   added: (lifting hoist3 crate4) (clear crate12)
   goals met: 8 of 12
128. (load hoist6 crate11 truck0 distributor0)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck0) (available hoist6)
   goals met: 8 of 12
129. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 8 of 12
130. (drop hoist3 crate4 crate12 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate12)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate12)
   goals met: 9 of 12
131. (drop hoist0 crate6 crate3 depot0)
   deleted: (lifting hoist0 crate6) (clear crate3)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate3)
   goals met: 10 of 12
132. (lift hoist3 crate4 crate12 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate12)
   added: (lifting hoist3 crate4) (clear crate12)
   goals met: 9 of 12
133. (lift hoist6 crate12 crate1 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist6) (on crate12 crate1)
   added: (lifting hoist6 crate12) (clear crate1)
   goals met: 9 of 12
134. (load hoist6 crate12 truck0 distributor0)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck0) (available hoist6)
   goals met: 9 of 12
135. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 9 of 12
136. (unload hoist0 crate12 truck0 depot0)
   deleted: (in crate12 truck0) (available hoist0)
   added: (lifting hoist0 crate12)
   goals met: 9 of 12
137. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 9 of 12
138. (drop hoist0 crate12 crate6 depot0)
   deleted: (lifting hoist0 crate12) (clear crate6)
   added: (available hoist0) (at crate12 depot0) (clear crate12) (on crate12 crate6)
   goals met: 10 of 12
139. (unload hoist6 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist6)
   added: (lifting hoist6 crate11)
   goals met: 10 of 12
140. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 10 of 12
141. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 10 of 12
142. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 10 of 12
143. (drop hoist0 crate4 crate12 depot0)
   deleted: (lifting hoist0 crate4) (clear crate12)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate12)
   goals met: 11 of 12
144. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 11 of 12
145. (load hoist6 crate11 truck0 distributor0)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck0) (available hoist6)
   goals met: 11 of 12
146. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 11 of 12
147. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 11 of 12
148. (drop hoist0 crate11 crate4 depot0)
   deleted: (lifting hoist0 crate11) (clear crate4)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate4)
   goals met: 12 of 12
